una1veritas/Arduino-public/hardware/Quaranta/boards.txt
##############################################################
atmega644.name=Quaranta 644p @16MHz

atmega644.upload.protocol=stk500
atmega644.upload.maximum_size=63488
atmega644.upload.speed=57600

atmega644.bootloader.low_fuses=0xFF
atmega644.bootloader.high_fuses=0x9A
atmega644.bootloader.extended_fuses=0xFF
atmega644.bootloader.path=atmega
atmega644.bootloader.file=ATmegaBOOT_168_atmega644p.hex
atmega644.bootloader.unlock_bits=0x3F
atmega644.bootloader.lock_bits=0x0F

atmega644.build.mcu=atmega644p
atmega644.build.f_cpu=16000000L
atmega644.build.core=arduino
atmega644.build.variant=quaranta

##############################################################
atmega6448m.name=Quaranta 644p @ 8MHz

atmega6448m.upload.protocol=stk500
atmega6448m.upload.maximum_size=63488
atmega6448m.upload.speed=38400

atmega6448m.bootloader.low_fuses=0xFF
atmega6448m.bootloader.high_fuses=0x9A
atmega6448m.bootloader.extended_fuses=0xFF
atmega6448m.bootloader.path=atmega
atmega6448m.bootloader.file=ATmegaBOOT_168_atmega644p_8m.hex
atmega6448m.bootloader.unlock_bits=0x3F
atmega6448m.bootloader.lock_bits=0x0F

atmega6448m.build.mcu=atmega644p
atmega6448m.build.f_cpu=8000000L
atmega6448m.build.core=arduino
atmega6448m.build.variant=quaranta

##############################################################
atmega1284.name=Quaranta 1284p @16MHz

atmega1284.upload.protocol=stk500
atmega1284.upload.maximum_size=131072
atmega1284.upload.speed=57600

atmega1284.bootloader.low_fuses=0xFF
atmega1284.bootloader.high_fuses=0x9A
atmega1284.bootloader.extended_fuses=0xFF
atmega1284.bootloader.path=atmega
atmega1284.bootloader.file=ATmegaBOOT_168_atmega1284p.hex
atmega1284.bootloader.unlock_bits=0x3F
atmega1284.bootloader.lock_bits=0x0F

atmega1284.build.mcu=atmega1284p
atmega1284.build.f_cpu=16000000L
atmega1284.build.core=arduino
atmega1284.build.variant=quaranta

##############################################################
atmega12848m.name=Quaranta 1284p @ 8MHz

atmega12848m.upload.protocol=stk500
atmega12848m.upload.maximum_size=131072
atmega12848m.upload.speed=38400

atmega12848m.bootloader.low_fuses=0xFD
atmega12848m.bootloader.high_fuses=0xDA
atmega12848m.bootloader.extended_fuses=0xFF
atmega12848m.bootloader.path=atmega
atmega12848m.bootloader.file=ATmegaBOOT_168_atmega1284p_8m.hex
atmega12848m.bootloader.unlock_bits=0x3F
atmega12848m.bootloader.lock_bits=0x0F

atmega12848m.build.mcu=atmega1284p
atmega12848m.build.f_cpu=8000000L
atmega12848m.build.core=arduino
atmega12848m.build.variant=quaranta

##############################################################
